{
  "config": {
    "schema": "gdosmm",
    "version": 1.1
  },
  "metadata": [
    "team",
    "security-champion",
    "source-code-repo",
    "issue-tracking",
    "wiki",
    "ci-server",
    "created-by",
    "hide-from-stats"
  ],
  "domains": {
    "Build and Deployment": {
      "practices": [
        "Build",
        "Deployment"
      ]
    },
    "Culture and Organisation": {
      "practices": [
        "Culture and Organisation"
      ]
    },
    "Information gathering": {
      "practices": [
        "Monitoring and Metric",
        "Logging"
      ]
    },
    "Infrastructur": {
      "practices": [
        "Infrastructur"
      ]
    },
    "Test and Verification": {
      "practices": [
        "Dynamic depth",
        "Static depth",
        "Test-Intensity",
        "Consolidation",
        "Application tests",
        "Infrastructure tests"
      ]
    }
  },
  "practices": {
    "Build": {
      "key": "Build",
      "activities": [
        "Build-4.",
        "Build-1.1",
        "Build-2.2",
        "Build-4.3",
        "Build-3.4",
        "Build-3.5"
      ]
    },
    "Deployment": {
      "key": "Deployment",
      "activities": [
        "Deployment-2.",
        "Deployment-4.1",
        "Deployment-1.2",
        "Deployment-3.3",
        "Deployment-4.4",
        "Deployment-3.5",
        "Deployment-3.6",
        "Deployment-3.7",
        "Deployment-2.8"
      ]
    },
    "Culture and Organisation": {
      "key": "Culture and Organisation",
      "activities": [
        "Culture and Organisation-4.",
        "Culture and Organisation-4.1",
        "Culture and Organisation-3.2",
        "Culture and Organisation-3.3",
        "Culture and Organisation-4.4",
        "Culture and Organisation-4.5",
        "Culture and Organisation-2.6",
        "Culture and Organisation-2.7",
        "Culture and Organisation-1.8",
        "Culture and Organisation-4.9",
        "Culture and Organisation-3.10",
        "Culture and Organisation-2.11",
        "Culture and Organisation-3.12"
      ]
    },
    "Monitoring and Metric": {
      "key": "Monitoring and Metric",
      "activities": [
        "Monitoring and Metric-3.",
        "Monitoring and Metric-3.1",
        "Monitoring and Metric-2.2",
        "Monitoring and Metric-4.3",
        "Monitoring and Metric-3.4",
        "Monitoring and Metric-4.5",
        "Monitoring and Metric-3.6",
        "Monitoring and Metric-4.7",
        "Monitoring and Metric-4.8",
        "Monitoring and Metric-1.9",
        "Monitoring and Metric-3.10",
        "Monitoring and Metric-2.11"
      ]
    },
    "Logging": {
      "key": "Logging",
      "activities": [
        "Logging-3.",
        "Logging-1.1",
        "Logging-4.2",
        "Logging-1.3",
        "Logging-2.4"
      ]
    },
    "Infrastructur": {
      "key": "Infrastructur",
      "activities": [
        "Infrastructur-2.",
        "Infrastructur-2.1",
        "Infrastructur-3.2",
        "Infrastructur-1.3",
        "Infrastructur-4.4",
        "Infrastructur-4.5",
        "Infrastructur-3.6",
        "Infrastructur-2.7",
        "Infrastructur-3.8",
        "Infrastructur-3.9",
        "Infrastructur-4.10",
        "Infrastructur-1.11",
        "Infrastructur-3.12"
      ]
    },
    "Dynamic depth": {
      "key": "Dynamic depth",
      "activities": [
        "Dynamic depth-4.",
        "Dynamic depth-2.1",
        "Dynamic depth-3.2",
        "Dynamic depth-3.3",
        "Dynamic depth-3.4",
        "Dynamic depth-4.5",
        "Dynamic depth-1.6",
        "Dynamic depth-2.7",
        "Dynamic depth-4.8"
      ]
    },
    "Static depth": {
      "key": "Static depth",
      "activities": [
        "Static depth-4.",
        "Static depth-4.1",
        "Static depth-4.2",
        "Static depth-3.3",
        "Static depth-2.4",
        "Static depth-4.5",
        "Static depth-3.6",
        "Static depth-1.7"
      ]
    },
    "Test-Intensity": {
      "key": "Test-Intensity",
      "activities": [
        "Test-Intensity-3.",
        "Test-Intensity-2.1",
        "Test-Intensity-1.2",
        "Test-Intensity-4.3"
      ]
    },
    "Consolidation": {
      "key": "Consolidation",
      "activities": [
        "Consolidation-4.",
        "Consolidation-4.1",
        "Consolidation-3.2",
        "Consolidation-4.3",
        "Consolidation-1.4",
        "Consolidation-2.5",
        "Consolidation-4.6",
        "Consolidation-1.7",
        "Consolidation-3.8"
      ]
    },
    "Application tests": {
      "key": "Application tests",
      "activities": [
        "Application tests-4.",
        "Application tests-4.1",
        "Application tests-2.2",
        "Application tests-1.3"
      ]
    },
    "Infrastructure tests": {
      "key": "Infrastructure tests",
      "activities": [
        "Infrastructure tests-4.",
        "Infrastructure tests-4.1",
        "Infrastructure tests-1.2",
        "Infrastructure tests-2.3",
        "Infrastructure tests-3.4"
      ]
    }
  },
  "activities": {
    "Build-4.": {
      "name": "Erlangt ein Angreifer Zugriff auf das Versionskontrollsystem eines Projekts oder auf die Konfiguration zur Erzeugung, kann dieser ggf. Zugriff auf das Erzeungs-System erlangen und dadurch andere Erzeugungsaufträge kompromittieren. Jeder Schritt der Erzeugung findet in einer seperaten virtuellen Umgebung statt.",
      "level": 4
    },
    "Build-1.1": {
      "name": "Die Erzeugung kann bei jedem mal unterschiedlich durchgeführt werden. Wird ein Fehler dabei gemacht können sicherheitsrelevante Konfigurationen falsch gesetzt werden. Es existiert ein definierter automatisierter Prozess für die Erzeugung, welcher manuell angestoßen werden kann.",
      "level": 1
    },
    "Build-2.2": {
      "name": "Vom pushen von Quellcode in die Versionskontrolle bis zur Rückmeldung, dass dieser Quellcode eine Schwachstelle enthält, kann Zeit vergehen. Dadurch ist es für den Entwickler schwieriger, gepushten Quellcode nachzuvollziehen und die Schwachstelle nachhaltig zu beseitigen. Bei jedem Push oder periodisch wird eine Verteilung auf eine Testumgebung durchgeführt und automatisch Tests- und Verifikationen durchgeführt, mindestens für die geänderten Quellcode-Bereiche.",
      "level": 2
    },
    "Build-4.3": {
      "name": "Manipuliert ein Angreifer ein Artefakt oder ein Abbild, wird dies ggf. nicht bemerkt. Durch Signierung und Signatur-Prüfungen von Artefakten und Abbildern ist sichergestellt, dass eine Manipulation oder der Austausch eines Artefakts beziehugnsweise Abbilds bemerkt wird.",
      "level": 4
    },
    "Build-3.4": {
      "name": "Es ist nicht nachvollziehbar, wie die Konfiguration der Erzeugungsumgebung verändert wurde. Durch Versionierung der Konfiguration von Aufträgen im Continuous Integration Server können Änderungen nachvollzogen werden.",
      "level": 3
    },
    "Build-3.5": {
      "name": "Ein Artefakt enthält eine Schwachstelle oder verursacht unerwartete Effekte, nachdem es auf Produktion ausgerollt wurde. Verteilungen werden versioniert. Es ist einfach auf eine vorherige Version zurück zu greifen.",
      "level": 3
    },
    "Deployment-2.": {
      "name": "Durch das Einspielen einer Aktualisierung in einer DBMS-Software können Fehler auftreten, welche zu Datenverlust führen. Automatische Backups werden vor der Verteilung neuer Software durchgeführt, sofern die Datenmenge dies in einer angemessenen Zeit zulässt. Wiederherstellung ist geprüft.",
      "level": 2
    },
    "Deployment-4.1": {
      "name": "Durch eine Verteilung kann die Verfügbarkeit des Systems gefährdet sein. Es wird nur auf einen Server die Verteilung angewendet und anschließend eine Post-Verteilungs-Prüfung vorgenommen, nur wenn diese erfolgreich ist, wird auf weitere Server deployed.",
      "level": 4
    },
    "Deployment-1.2": {
      "name": "Verteilungen können unterschiedlich durchgeführt werden. Wird ein Fehler bei der Verteilung gemacht, welcher manuell korrigiert werden muss, kann die Verfügbarkeit beeinträchtigt werden. Mögliche Scenarien sind entsprechend: Es können Sicherheits-Tests, welche das Abbild validieren vergessen werden. Es wird ein Abbild erzeugt, allerdings ein anderes Abbild deployed. Durch einen definierten Verteilungs-Prozess wird die Verfügbarkeit erhöht, da Fehler reduziert werden.",
      "level": 1
    },
    "Deployment-3.3": {
      "name": "Angreifer, welche Zugang zum Quellcode und damit zur Konfiguration erhalten, können schutzwürdige Informationen wie Datenbank-Zugänge einsehen. Bei Verteilungen werden schutzbedürftige Konfigurationsparameter je nach Umgebung gesetzt. So kann beispielsweise der Datenbank-Zugang über Umgebungsvariablen gesetzt werden.",
      "level": 3
    },
    "Deployment-4.4": {
      "name": "Es sind schwer durch Automatisierung zu findene Schwachstellen in der Anwendung vorhanden. Kunden haben Zugriff auf eine Vor-Produktions-Version und können das System prüfen.",
      "level": 4
    },
    "Deployment-3.5": {
      "name": "Es werden unterschiedliche Aktionen in der Testumgebung und der Produktionsumgebung ausgeführt. Beispielsweise folgender Quellcode: if (host == 'production') {} else {} Es werden Umgebungsvariablen oder Parameter beim Starten des Artefakts verwendet. Verhalten wird nur über Konfiguration gesteuert und nicht über Hostnamen o.ä..",
      "level": 3
    },
    "Deployment-3.6": {
      "name": "Durch eine Verteilung ist die Verfügbarkeit des Systems beeinträchtigt. Es ist ein lückenloser Verteilungs-Prozess definiert.",
      "level": 3
    },
    "Deployment-3.7": {
      "name": "Es wird ein unterschiedliches Artefakt beziehugnsweise eine unterschiedliche Abbildung der Anwendung für die Testumgebung und die Produktionsumgebung verwendet. Entsprechend können auf der Produktionsumgebung unerwartete Effekte auftreten. Das gleiche Artefakt der Anwendung von der Testumgebung wird auf der Produktionsumgebung verwendet.",
      "level": 3
    },
    "Deployment-2.8": {
      "name": "Angreifer, welche Zugang zum Quellcode und damit zur Konfiguration erhalten, können schutzwürdige Informationen wie Datenbank-Zugänge einsehen. Bei Verteilungen werden schutzbedürftige Konfigurationsparameter je nach Umgebung gesetzt. So kann beispielsweise der Datenbank-Zugang über Umgebungsvariablen gesetzt werden.",
      "level": 2
    },
    "Culture and Organisation-4.": {
      "name": "Bedrohungen werden ungenügend identifiziert. Bedrohungen werden modelliert.",
      "level": 4
    },
    "Culture and Organisation-4.1": {
      "name": "Teams sind ungenügend auf für das Thema Sicherheit sensibilisiert. Teams prüfen die Webanwendung eines anderen Teams. Dadurch wird die Sicherheit der Webanwendung, das Sicherheits-Bewustsein und das Wissen im Bereich Sicherheit erhöht. Zusätzlich können neue soziale Kontakte in einer Organisation entstehen.",
      "level": 4
    },
    "Culture and Organisation-3.2": {
      "name": "Sicherheitsprüfungen des Quellcodes durch Externe schaffen kein Verständnis für Sicherheit bei Entwicklern und System-Administratoren. Periodische Sicherheitsprüfungen des Quellcodes, bei welchem ein Sicherheitsexperte zusammen mit Entwicklern und System-Adminstratoren Quellcode prüft, erhöhen die Sicherheit und verbreiten Wissen.",
      "level": 3
    },
    "Culture and Organisation-3.3": {
      "name": "Bedrohungen werden nicht identifiziert. Bedrohungen werden anhand einer einfachen Risikomatrix mit Schadenpotential und Wahrscheinlichkeit des Eintritts geplegt. Im Product Backlog wird eine Bedrohungsanalyse auf Geschäftsprozess-Ebene gepflegt. Beim Sprint Planning erfolgt eine technische Bedrohungsanalyse.",
      "level": 3
    },
    "Culture and Organisation-4.4": {
      "name": "Notfallpläne sind nicht eingeübt und Personen können im Fall einer Bedrohung überfordert mit der Situation sein. War Games sind ein Ansatz der Gamifizierung, bei denen ein Sicherheitsexperte ein Angriffsszenario entwickelt und vorbereitet. Beispielsweise den Ausfall einer Netzwerkschnittstelle eines Datenbankservers oder ein Bruteforce-Angriff auf Benutzerkonten. Anschließend wird das Angriffsszenario auf einer produktionsnahen Umgebung ausgeführt. Das zugehörige Team, welches für die Betreuung des Systems und der Anwendung zuständig ist, hat die Aufgabe das System wieder zu reaktivieren oder den Angriff zu analysieren und Gegenmaßnahmen einzuleiten.",
      "level": 4
    },
    "Culture and Organisation-4.5": {
      "name": "Sicherheitsrelevante Betrachtungen werden zu Oberflächlich durchgeführt. Es werden AbUser Stories beschrieben, bei welchem erweitertes Wissen eines Sicherheits-Experten notwendig ist.",
      "level": 4
    },
    "Culture and Organisation-2.6": {
      "name": "Bei der Erstellung von User Stories werden negative Stories aus Sicht eines Angreifers nicht eingenommen und entsprechend nicht beachtet. Es werden einfache AbUser Stories in agilen Phasen gepflegt. Beispielsweise im Product Backlog und Sprint Backlog.",
      "level": 2
    },
    "Culture and Organisation-2.7": {
      "name": "Da kein Sicherheits-Verantwortlicher definiert ist, fühlt sich niemand im Team für Informations-Sicherheit verantwort. Pro Team ist ein Sicherheitsverantwortlicher (häufig 'Security-Champion genannt') definiert.",
      "level": 2
    },
    "Culture and Organisation-1.8": {
      "name": "Mitarbeiter kennen die Sicherheits-Ziele der Organisation nicht. Durch transparente Kommunikation der Sicherheitsziele durch das Management der Organisation wird der Wert von Sicherheit für das Unternehmen klargestellt.",
      "level": 1
    },
    "Culture and Organisation-4.9": {
      "name": "Security-Champions habe kein Experten-Wissen und können Sicherheit, z.B. via Stories, nicht auf hohem Niveau integrieren. Durch einen Web-Sicherheitsexperten kann Sicherheit hinreichend, z.B. via Stories oder durch einen Penetrations-Tests, in Sprints integriert werden",
      "level": 4
    },
    "Culture and Organisation-3.10": {
      "name": "Eine Person hat wenig Wissen im Bereich Sicherheit und implementiert Schwachstelle oder vergisst Gegenmaßnahmen zu ergreifen. Bei jeder neuen Version eines Systems oder einer Anwendung (in der Entwicklung bei der Überführung einer Branch in den Master, in der System-Administration via Konfigurations-Änderung) wird ein Review aller Änderungen durch eine zweite Person durchgeführt.",
      "level": 3
    },
    "Culture and Organisation-2.11": {
      "name": "Mitarbeiter nehmen das Thema Informations-Sicherheit nicht ernst. Gute Kommunikation über das Thema Informations-Sicherheit wird belohnt. Beispielsweise mittels T-Shirts, girfcards und 'High-Fives'",
      "level": 2
    },
    "Culture and Organisation-3.12": {
      "name": "Da Informations-Sicherheits-Vorfälle nicht diskutiert werden, kann aus diesn nicht gelernt werden. Entsprechend können diese öfter auftreten. Durch Sicherheits-Lessoned-Learned, bei welcher Informations-Sicherheits-Vorfälle erörtert werden, erhalten Mitarbeiter Einblick in Informations-Sicherheit und ein erhöhtes Bewusstsein für Sicherheit.",
      "level": 3
    },
    "Monitoring and Metric-3.": {
      "name": "Es sind nicht ausreichend Metriken erfasst um alle Trends zu erfassen oder bei einem Angriff ausreichend Informationen zu erhalten. Erweiterte Metriken um die Verfügbarkeit und Stabilität zu erfassen. Insbesondere ungeplante Ausfallzeiten sollten erfasst werden, da diese zu Vertragsstrafen führen können. Typischerweise werden diese über eine Periode, beispielsweise ein Jahr, erfasst.",
      "level": 3
    },
    "Monitoring and Metric-3.1": {
      "name": "Das Sicherheitsniveau der Webanwendung ist unbekant. Alle Ergebnisse aus der Dimension Test- und Verifizierung werden instrumentiert.",
      "level": 3
    },
    "Monitoring and Metric-2.2": {
      "name": "Es wird zu spät gemerkt, wenn Systeme ungewöhnliches verhalten aufweisen. Grenzen für Metriken sind definiert und das System alarmiert.",
      "level": 2
    },
    "Monitoring and Metric-4.3": {
      "name": "Die Effektivität von Kontrollmanahmen wie Konfiguration, Patch und Schwachstellen Management ist unbekannt. Einführung von Abdeckungs- und Kontroll-Metriken. Durch Abdeckungs- und Kontroll-Metriken wird aufgezeigt wie effektiv das Sicherheits-Programm einer Organisation ist. Sicherheits-Programme sind u.a. durch unternehmensweite Richtlinien gestützt, allerdings werden diese nicht immer eingehalten. Abdeckung ist der Grad zu welcher eine bestimmte Sicherheitskontrolle für eine bestimmte Zielgruppe mit allen Ressourcen angewendet wird. Der Kontroll-Grad zeigt die tatsächliche Anwendung von vorgegebenen Sicherheits-Standards und -Richtlinien. Entsprechend werden durch Abdeckungs- und Kontroll-Metriken Lücken bei der Umsetzung von Richtlinien und Standards aufgezeigt. Umfassende Abdeckungs- und Kontroll-Metriken beinhalten das Sammeln von Informationen zu Anti-Virus Software sowie Anti-Rootkits, Patch Management, Server-Konfiguration und Schwachstellen-Management.",
      "level": 4
    },
    "Monitoring and Metric-3.4": {
      "name": "Durch sammeln ungenutzter Metriken werden Ressourcen verschwendet, welche für sicherheitsrelevante Dienste genutzt werden könnten. Durch Deaktivierung ungenutzter Metriken stehen mehr Ressourcen zur Verfügung.",
      "level": 3
    },
    "Monitoring and Metric-4.5": {
      "name": "Angriffserkennungssysteme wie eine Paketfilter-Firewalls oder Web-Application-Firewall erkennen und blockieren Angriffe, jedoch ist unbekannt wie viele Angriffe abgewehrt werden und es wird ggf. nicht erkannt, wenn ein Angriff stattfindet. Einführung von Verteidigungs-Metriken. Verteidigungs-Metriken beinhalten das Sammeln von Informationen zu Anti-Virus- und Anti-Rootkit-Lösungen, Firewalls, Netzwerken und Angriffen. Beispielsweise kann die Anzahl der eingehenden Verbindung nach TCP\/UDP-Port gemessen werden und beinhaltet implizit die Anzahl der eingehenden Verbindung nach TCP\/UDP-Protokoll. Durch Sammeln der Internetprotokoll-Adressen von eingehenden Verbindungen kann der geografische Quell-Standort ermittelt werden.",
      "level": 4
    },
    "Monitoring and Metric-3.6": {
      "name": "Da sicherheitsrelevante Metriken nicht gruppiert sind, kann es zu Verzögerungen bei der Analyse von Vorfällen kommen. Metriken sind sinnvoll gruppiert.",
      "level": 3
    },
    "Monitoring and Metric-4.7": {
      "name": "Änderungen führen zu erhöhter Last aufgrund Programmierfehler. Erweiterte Metriken werden bei Tests aufgezeichnet und ausgewertet.",
      "level": 4
    },
    "Monitoring and Metric-4.8": {
      "name": "Sicherheitsrelevante Informationen, z.B. bei einem Angriff, werden verspätet erkannt. Ein intern zugänglicher Bildschirm zeigt sicherheitsrelevante Metriken.",
      "level": 4
    },
    "Monitoring and Metric-1.9": {
      "name": "Systemadministratoren und Entwickler müssen, um einen Überblick über verschiedene virtuelle Systeme zu erlangen, sich auf diesen einloggen. Insbesondere Entwicklern ohne Linux-Kentnisse fällt die Auswertung von Protokollen auf Grundlage der Linux-Befehle cat, grep und awk schwer. Einfache Anwendungs- und System-Metriken sind erfasst.",
      "level": 1
    },
    "Monitoring and Metric-3.10": {
      "name": "Es werden falsche Personen über einen Vorfall informiert. Durch zielgerichtete Information über Vorfälle kann besser auf Vorfälle reagiert werden.",
      "level": 3
    },
    "Monitoring and Metric-2.11": {
      "name": "Metriken werden mangelhaft dargestellt und können deshalb nur begrenzt ausgewertet werden. Metriken sind visuell in Echtzeit dargestellt. Dabei unterstützt eine benutzerfreundliche Bedienoberfläche.",
      "level": 2
    },
    "Logging-3.": {
      "name": "Treten Ausnahmen in Anwendungen auf, werden diese verzögert oder gar nicht manuell geprüft. Ausnahmen werden Instrumentiert und zentral Protokolliert. Zusätzlich wird ein Alarm gemeldet.",
      "level": 3
    },
    "Logging-1.1": {
      "name": "Protokolle sind nicht sichtbar und können bei Einbruch in ein System manipuliert werden. Protokolle werden zentral erfasst.",
      "level": 1
    },
    "Logging-4.2": {
      "name": "Sicherheits-Ereignisse werden nicht korreliert, so dass Zusammennhänge zwischen Ereignissen nicht erkannt werden. Sicherheits-Ereignisse werden korreliert. Beispielsweise erhöhte Anmeldeverusuche mit erfolgreichen Anmeldungen.",
      "level": 4
    },
    "Logging-1.3": {
      "name": " ",
      "level": 1
    },
    "Logging-2.4": {
      "name": "Protokolle werden mangelhaft dargestellt und können deshalb nur begrenzt ausgewertet werden. Insbesondere Entwickler können die in Dateien erfassten Protokolle mittels ungewohnten Werkzeugen wie 'cat', 'grep' und 'less' schwer auswerten. Protokolle sind in einer Oberfläche in Echtzeit dargestellt. Dabei unterstützt eine benutzerfreundliche Bedienoberfläche inklusive Visualisierung von einfachen Protokoll-Metriken.",
      "level": 2
    },
    "Infrastructur-2.": {
      "name": "Durch einen Einbruch erlangt ein Angreifer Zugriff auf alle auf einem Server laufenden Anwendungen. Anwendungen laufen in virtuellen Umgebungen.",
      "level": 2
    },
    "Infrastructur-2.1": {
      "name": "Genutzte Software wird ohne Prüfung der Quelle geladen und verwendet. Software kann dabei ein Paket des Betriebssystems, ein Abbild eines Betriebssystems, ein geladenes Plugin für einen Continuous Integration-Server oder eine Bibliothek in einer Anwendung sein. Jede Software-Quelle ist manuell auf Vertraulichkeit geprüft.",
      "level": 2
    },
    "Infrastructur-3.2": {
      "name": "Virtuelle Umgebungen können auf Sockets anderer virtueller Umgebungen zugreifen, auch wenn dies nicht notwendig ist. Die Kommunikation zwischen virtuellen Umgebungen ist reguliert.",
      "level": 3
    },
    "Infrastructur-1.3": {
      "name": "Angreifer erhalten Zugriff auf interne Systeme ohne Authentifizierung und können Daten mitschneiden. Alle internen Systeme sind mit einfacher Authentifizierung und Verschlüsselung geschützt.",
      "level": 1
    },
    "Infrastructur-4.4": {
      "name": "Eine Schwachstelle von Containern sind System-Aufrufe, welche nicht den Namespace beachten Betriebssystem-Aufrufe von Anwendungen in virtuellen Umgebungen sind limitiert und auf einer Positivliste eingetragen",
      "level": 4
    },
    "Infrastructur-4.5": {
      "name": "Komponenten sind komplex und schwer testbar. Es ist eine Mikroservice-Architektur genutzt.",
      "level": 4
    },
    "Infrastructur-3.6": {
      "name": "Ein vorheriges Produktionsartefakt lässt sich nicht wieder starten, wenn die Verteilung einer neuen Version nicht klappt. Alle Produktions-Artifakte sind versioniert.",
      "level": 3
    },
    "Infrastructur-2.7": {
      "name": "Erstellung produktionsnaher Umgebungen ist schwer. Tritt eine Schwachstelle nur in der Produktionsumgebung auf, ist es schwierig diese auf einer lokalen Entwicklungsumgebung nachzuvollziehen. Durch Nutzung von einer virtuellen Umgebung und Ablage der Konfiguration im Quellcode, lässt sich eine Produktionsumgebung nachstellen.",
      "level": 2
    },
    "Infrastructur-3.8": {
      "name": "Manuelles Aufsetzen von System-Umgebungen kann zu fehlerhaften Konfigurationen sowie zu diskrepanzen bei redundanten Systemen führen. Mittels automatisierter Provisionierung werden System-Umgebungen aufgesetzt (Stichwort: Infrastructure as Code).",
      "level": 3
    },
    "Infrastructur-3.9": {
      "name": "Da jeder auf einem System jede Aktion ausführen darf, ist nicht prüfbar wer eine Aktion, wie die Änderung einer Konfiguration auf dem Erzeugungs- und Verteilungsserver, ausgeführt hat. Nutzung von Rollen-basierter Authentifizierung und Autorisierung, ggf. verbunden mit einem zentralem Authentifizierungs-Server.",
      "level": 3
    },
    "Infrastructur-4.10": {
      "name": "Durch manuelle Änderungen an Systemen sind diese nicht auswechselbar. Die Verfügbarkeit eines redundanten Systems kann beeinträchtigt werden. Durch zufälliges Runterfahren von redundandten Systemen wird sichergestellt, dass alle Änderungen versioniert sind und die Systeme tatsächlich hochverfügbar sind.",
      "level": 4
    },
    "Infrastructur-1.11": {
      "name": "Sicherheits-Tests werden aufgrund mangelnder Test-Umgebungen nicht durchgeführt. Es existiert eine Produktiv-Umgebung und mindestens eine Test-Umgebung",
      "level": 1
    },
    "Infrastructur-3.12": {
      "name": "Wird eine Anwendung in einer virtuellen Umgebung angegriffen oder hat einen Defekt, kann dies zu erhöhter Ressourcen-Nutzung führen, wodurch auch andere Anwendung auf dem gleichem Server stark beeinträchtigt werden können. Alle virtuellen Umgebungen besitzen Limitierungen für Arbeitsspeicher, Festplattendurchsatz, Festplattenplatz und Prozessoren.",
      "level": 3
    },
    "Dynamic depth-4.": {
      "name": "Teile der Anwendung sind beim Spidern mit einem Web-Security-Scanner nicht abgedeckt. Prüfung mittels Abdeckungsanalyse-Werkzeuge welche Teile beim Spidern beziehungsweise bei der Nutzung von eigenen Werkzeugen nicht angesprochen werden um Justierung vornehmen zu können.",
      "level": 4
    },
    "Dynamic depth-2.1": {
      "name": "Teile der Anwendung, insbesondere welche mit vom Browser interpretierten dynamischen Inhalten wie JavaScript, sind beim Spidern mit einem Web-Security-Scanner nicht abgedeckt. Nutzung eines Spiders welcher dynamische Inhalte ausführt.",
      "level": 2
    },
    "Dynamic depth-3.2": {
      "name": "Versteckte Pfade, wie beispielsweise APIs werden nicht abgedeckt. Versteckte Pfade werden abgedeckt.",
      "level": 3
    },
    "Dynamic depth-3.3": {
      "name": "Teile der Anwendung, insbesondere welche mit speziell formatierten oder kodierten Parametern (z.B. Suchmaschinenoptimierte Parameter in der URL, Kommunikation via WebSockets, Parameter in JSON oder Base64-Kodierte Parameter), werden beim Erfassen bestehender Pfade mit einem Web-Security-Scanner nicht abgedeckt. Spezielle Parameter und Kodierungen sind in eingesetzten Web-Security-Scannern definiert.",
      "level": 3
    },
    "Dynamic depth-3.4": {
      "name": "Sequenziellen Aktionen wie Workflows sind beim Spidern mit einem Web-Security-Scanner nicht abgedeckt. Seqenzielle Aktionen werden definiert, so dass der Scanner diese in der korrekten Reihenfolge prüft.",
      "level": 3
    },
    "Dynamic depth-4.5": {
      "name": "Serverseitige Kommunikation, wie bei der Nutzung von Microservices, ist ungeprüft. Backend-Kommunikation ist aufgezeichnet und ist geprüft.",
      "level": 4
    },
    "Dynamic depth-1.6": {
      "name": "Mangelhafte Sicherheitsprüfungen. Nach einer Verteilung können einfache Schwachstellen lange Zeit unerkannt in der Produktionsumgebung vorhanden sein. Ein einfacher Scan wird mit einem Web-Security-Scanner regelmäßig durchgeführt. Sofern die Prüfung in angemessener Zeit erfolgt, während jeder Verteilung.",
      "level": 1
    },
    "Dynamic depth-2.7": {
      "name": "Teile der Anwendung, insbesondere welche mit Authentifizierung, sind beim Spidern mit einem Web-Security-Scanner nicht abgedeckt. Integration von Authentifizierung mit verschiedenen Rollen und Session Management",
      "level": 2
    },
    "Dynamic depth-4.8": {
      "name": "Ein Web-Security-Scanner ist ggf. nicht optimiert für alle genutzten Technologien. Entsprechend können Schwachstellen unerkannt bleiben. Es sind weitere spezielle Scanner eingesetzt.",
      "level": 4
    },
    "Static depth-4.": {
      "name": "Quellcode-Dupliakte können die Stabilität beeinträchtigen. Erkennung und Meldung von Duplikaten in Quellcode.",
      "level": 4
    },
    "Static depth-4.1": {
      "name": "Von der Webanwendung genutzt Bibliotheken enthalten unbekannte Schwachstellen in der Implementierung. Es wird eine statische Analyse, in Form von String Matching Algorithmen und\/oder Datenflussanalysen, für serverseitige und klientenseitige Bibliotheken durchgeführt.",
      "level": 4
    },
    "Static depth-4.2": {
      "name": "Teile der Webanwendung enthalten Schwachstellen in der Implementierung. Es wird eine statische Analyse, in Form von String Matching Algorithmen und\/oder Datenflussanalysen, für alle Bereiche der serverseitigen und klientenseitigen Webanwendung durchgeführt. Externe Bibliotheken werden nicht geprüft.",
      "level": 4
    },
    "Static depth-3.3": {
      "name": "Wichtige Teile der klientenseitigen Webanwendung enthalten Schwachstellen in der Implementierung. Es wird eine statische Analyse, in Form von String Matching Algorithmen und\/oder Datenflussanalysen, für wichtige Teile der klientenseitigen Webanwendung durchgeführt.",
      "level": 3
    },
    "Static depth-2.4": {
      "name": "Wichtige Teile der serverseitigen Webanwendung enthalten Schwachstellen in der Implementierung. Es wird eine statische Analyse, in Form von String Matching Algorithmen und\/oder Datenflussanalysen, für wichtige Teile der serverseitigen Webanwendung durchgeführt. Die statische(n) Analyse(n) wird automatisiert durchgeführt und nach Möglichkeit in die Entwicklungsumgebung integriert.",
      "level": 2
    },
    "Static depth-4.5": {
      "name": "Durch falsche Einrückung werden Schwachstellen eingeführt. Durch Überprüfung von Programmkonventionen (Style Guides) ist sichergestellt, dass diese eingehalten werden.",
      "level": 4
    },
    "Static depth-3.6": {
      "name": "Eingesetzte klientenseitige Komponten können Fehler enthalten, so dass die Informationssicherheit beeinträchtigt wird. Diese können u.a. erst nach Verteilung der Webanwendung bekannt werden. Tests auf klientenseitige Komponenten mit bekannten Schwachstellen werden regelmäßig durchgeführt, beispielsweise jede Nacht.",
      "level": 3
    },
    "Static depth-1.7": {
      "name": "Eingesetzte serverseitige Komponten können Fehler enthalten, so dass die Informationssicherheit beeinträchtigt wird. Diese können u.a. erst nach Verteilung der Webanwendung bekannt werden. Tests auf serverseitige Komponenten mit bekannten Schwachstellen werden regelmäßig durchgeführt, beispielsweise jede Nacht.",
      "level": 1
    },
    "Test-Intensity-3.": {
      "name": "Scans führen zu viele oder zu wenig Scans für unterschiedliche Schwachstellen durch. Die Test-Intensität ist angepasst.",
      "level": 3
    },
    "Test-Intensity-2.1": {
      "name": "Prüfungen nehmen stark Ressourcen in Anspruch. Unnötige Prüfungen sind deaktiviert. Benutzt eine Webanwendung die Mongo-Datenbank, kann ggf. auf eine SQL-Injection-Prüfung verzichtet werden.",
      "level": 2
    },
    "Test-Intensity-1.2": {
      "name": "Durch Zeitdruck und Unwissenheit werden falsche Annahmen für die Intensität getroffen. Es ist die Standardeinstellungen für die Intensität von Werkzeugen genutzt.",
      "level": 1
    },
    "Test-Intensity-4.3": {
      "name": "Durch zu niedriger Scan-Intensität werden Schwachstellen nicht aufgedeckt. Möglichst alle Schwachstellen-Tests werden periodisch mit hoher Test-Intensität durchgeführt.",
      "level": 4
    },
    "Consolidation-4.": {
      "name": "Aufgrund der einfachen Visualisierung von Alarmen sind zusammenhänge nicht auf den ersten Blick erkennbar. Alarme werden als Metrik erfasst visualisiert.",
      "level": 4
    },
    "Consolidation-4.1": {
      "name": "Die Wartung von Alarmen und falsch Positiven in unterschiedlichen Werkzeugen und Definitionen erhöht den Aufwand stark. Aggregation von Alarmen, dabei werden auch doppelte Alarme nach Möglichkeit zusammengeführt.",
      "level": 4
    },
    "Consolidation-3.2": {
      "name": "Jedes Team muss jeden Alarm prüfen, so kann Frust entstehen. Alarme werden Teams zugewiesen, so dass keine Ressourcen verschwendet werden.",
      "level": 3
    },
    "Consolidation-4.3": {
      "name": "Alarme können von Entwicklern \/ System-Adminstratoren ggf. nur schwer nachvollzogen werden. Alarme enthalten den Ablauf der Aktionen um die gemeldete Schwachstelle einfacher reproduzieren zu können.",
      "level": 4
    },
    "Consolidation-1.4": {
      "name": "Aufgrund von mehrfach falsch positiv gemeldeten Schwachstellen werden neue Warnungen ignoriert. Falsch positiv gemeldete Schwachstellen werden, auf Basis von Werkzeugen, markiert und bei der nächsten Prüfung nicht mehr gemeldet.",
      "level": 1
    },
    "Consolidation-2.5": {
      "name": "Es ist unklar, wie viele Alarme im Monat entstehen. Alarme werden einach visualisiert um einfache Trendanalyse durchführen zu können.",
      "level": 2
    },
    "Consolidation-4.6": {
      "name": "Alarme mit Schwere 'Einfach' werden nicht beachtet. Akzeptanzkretieren für gefundene Schwachstellen sind definiert. Empfehlung ist Meldungen mit der Schwere 'Einfach' ebenfalls zu behandeln.",
      "level": 4
    },
    "Consolidation-1.7": {
      "name": "Mangelhafte Auswertung der erfolgten Sicherheitsprüfungen. Akzeptanzkretieren für gefundene Schwachstellen sind definiert. Empfehlung ist hier nur als kritisch eingestufte Schwachstellen\/Alarme zu behandeln. Sofern die genutzten Werkzeuge es anbieten, kann auch das Vertrauen (Englisch Confidence) mit zur Einstufung herangezogen werden. Entsprechend wird die Erzeugung markiert oder gestoppt, wenn Schwachstellen mit einer Sicherheitseinstufung über der definierten Akzeptanz gefunden werden.",
      "level": 1
    },
    "Consolidation-3.8": {
      "name": "Mittelschwere Alarme werden nicht beachtet. Akzeptanzkretieren für gefundene Schwachstellen sind definiert. Empfehlung ist mittelschwere Meldungen ebenfalls zu behandeln.",
      "level": 3
    },
    "Application tests-4.": {
      "name": "Es sind nicht alle Teile der Anwendung mit Sicherheitsprüfungen versehen. Implementierung grundlegender Sicherheitstests als Integrations- und\/oder Akzeptanztests für alle Teile (auch Bibliotheken) der Anwendung.",
      "level": 4
    },
    "Application tests-4.1": {
      "name": "Durch eine Verteilung auf die Produktionsumgebung können Mikroservices gestört sein, z.B. wenn die Datenbank nicht erreicht werden kann. Integrationstests prüfen die Produktionsumgebung um sicher zu stellen, dass Funktionen, z.B. bereitgestellt durch Mikroservices oder externe Dienste, erreichbar sind.",
      "level": 4
    },
    "Application tests-2.2": {
      "name": "In der Anwendung sind grundlegende Fehler bei der Benutzung eines Frameworks möglich, ohne das diese erkannt werden. Implementierung grundlegender Sicherheitstests als und Integrationstests. Beispielsweise kann die Authentifizierung und Autorisierung (Zugriffskontrolle) geprüft werden.",
      "level": 2
    },
    "Application tests-1.3": {
      "name": "Schwachstellen sind unbeachbsichtigt Implementiert. Integration von sicherheitsrelevanten Modultests für geschäftskritische Bereiche. Dadurch können Schwachstellen wie fehlende Authentifizierung erkannt werden.",
      "level": 1
    },
    "Infrastructure tests-4.": {
      "name": "Systeme wie Firewalls können nach einer Anpassung sicherheitskritisch konfiguriert sein. Automatische Prüfung von Infrastruktur-Systemen wie Firewalls.",
      "level": 4
    },
    "Infrastructure tests-4.1": {
      "name": "Es ist unbekannt wie viele Anfragen das System bedienen kann und wie sich das System bei vielen Anfragen verhält. Last-Tests werden periodisch ausgeführt.",
      "level": 4
    },
    "Infrastructure tests-1.2": {
      "name": "Das Betriebssystem oder seine Dienste enthalten bekannte Schwachstellen. Häufig laufen Docker-Container zu lange ohne System-Aktuallisierung zu erhalten. Prüfung auf Aktualisierungen und bei veralteter Software Meldung an einen Verantwortlichen, welcher die Patches einspielt.",
      "level": 1
    },
    "Infrastructure tests-2.3": {
      "name": "Virtuelle Umgebungen birgen die Gefahr sicherheitskritisch Konfiguriert zu sein. Mit Hilfe von Werkzeugen wird die Konfiguration von virtuellen Umgebungen geprüft.",
      "level": 2
    },
    "Infrastructure tests-3.4": {
      "name": "Mitarbeiterkonten und priviligierte Benutzerkonten sind mit schwachen Passwörtern geschützt. Automatische BruteForce-Angriffe auf Benutzer-Konten von Mitarbeitern sowie Standard-Konten wie 'administrator'.",
      "level": 3
    }
  }
}